###################################
# Add custom taps
###################################

tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/php"
tap "homebrew/services"
tap "homebrew/versions"
tap "caskroom/fonts"

###################################
# Install applications via Homebrew
###################################

# Essentials
brew "brew-cask-completion"
brew "git"
brew "mas"
brew "mackup"
brew "node"
brew "yarn", args: ["without-node"]

# ZSH specific
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "z"

# Manage node
brew "nvm"

# Manage ruby
brew "rbenv" # Ruby is required for react native

# Unix utilities
brew "tree"
brew "wget"

# Utilities
brew "gpg"
brew "openssl"
brew "python3"
brew "php", restart_service: true
brew "php@7.1"
brew "mongodb", restart_service: true
brew "mysql", restart_service: true
brew "nginx", restart_service: true

###################################
# Install applications via Cask
###################################

# Essentials
cask "iterm2"
cask "sequel-pro"

# Native dev
cask "android-studio"
cask "android-platform-tools"
cask "java" # java 7
cask "java8"

# Browsers
cask "firefox"
cask "firefox-developer-edition"
cask "google-chrome"

# Editors
cask "visual-studio-code"

# Utilities
cask "alfred"
cask "docker"
cask "flux"
cask "google-backup-and-sync"
cask "gpg-suite"
cask "postman"
cask "slack"
cask "spotify"
cask "setapp"
cask "font-fira-code"
cask "spectacle"


###################################
# Install applications via MAS
###################################
mas "Affinity Designer", id: 824171161
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Pocket", id: 568494494
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Things3", id: 904280696
